app/views/jobs/_form.html.erb

SELECT `job_emails`.* FROM `job_emails` WHERE `job_emails`.`job_id` = 2 ORDER BY `job_emails`.`id` ASC LIMIT 1
---
     <%if params[:action] =='edit'%>
        <%= text_field_tag 'job[email]' , @job.job_emails.first.email,:class => "form-control",:readonly => 'true' %>

SELECT `categories`.* FROM `categories`
---
    <div class="controls">
      <%= f.select :category, options_for_select({ "Category1" => "Category1", "Category2" => "Category2" , "Category3" => "Category3"}), {prompt: "Select a Category"},{class: "form-control",:style => "width:200px;"} %>