app/views/jobs/show.html.erb

  <td>Email</td>
  <td><%= @job.job_emails.first.email %></td>
---
SELECT `job_emails`.* FROM `job_emails` WHERE `job_emails`.`job_id` = 1 ORDER BY `job_emails`.`id` ASC LIMIT 1