app/views/forem/topics/_topic.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
    <div class='subject'><%= link_to forem_emojify(topic.subject), forem.forum_topic_path(@forum, topic) %></div>
    <div class='started-by'><%= t "started_by" %><%= relevant_posts(topic).first.user %></div>