app/controllers/jobs_controller.rb

INSERT INTO "job_emails" ("created_at", "email", "job_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 12 Apr 2014 05:47:21 UTC +00:00], ["email", "sada@sadas.com"], ["job_id", 1], ["updated_at", Sat, 12 Apr 2014 05:47:21 UTC +00:00]]
---
  def create
    @job = Job.new(job_params)

    respond_to do |format|
      if @job.save
        @job_email = JobEmail.new(:job_id => @job.id , :email => params[:job][:email])
        @job_email.save!